tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "confluentinc/ccloud"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "horar/openconnect-gui"
tap "jesseduffield/lazydocker"
tap "kryptco/tap"
tap "nextdns/tap"
tap "transcend-io/tap"
tap "versent/taps"
tap "wagoodman/dive"
tap "wata727/tflint"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Automate deployment, configuration, and upgrading
brew "ansible@2.8"
# Record and share terminal sessions
brew "asciinema"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Implementation of the DNS protocols
brew "bind"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Generic template rendering and notifications with Consul
brew "consul-template"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Completion script for docker-compose
brew "docker-compose-completion"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal-based visual file manager
brew "midnight-commander"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# DNS benchmark utility
brew "namebench"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Open Fortinet client for PPP+SSL VPN tunnel services
brew "openfortivpn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Tool to build, change, and version infrastructure
brew "terraform@0.12"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vpnc-script replacement for easy and secure split-tunnel VPN setup
brew "vpn-slice"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Linter for YAML files
brew "yamllint"
# View colored diff with side by side and auto pager support
brew "ydiff"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Nomad
brew "hashicorp/tap/nomad"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Krypton command-line client, daemon, and SSH integration
brew "kryptco/tap/kr"
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
# Android SDK component
cask "android-platform-tools"
# Two-factor authentication software
cask "authy"
cask "aws-vault"
# Disk space visualizer
cask "daisydisk"
# Visually compare and merge files
cask "diffmerge"
cask "discord-ptb"
# App to build and share containerized applications and microservices
cask "docker-edge"
cask "firefox-developer-edition"
cask "google-backup-and-sync"
cask "google-chrome-canary"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Tool to show what is persistently installed on the computer
cask "knockknock"
cask "logitech-camera-settings"
# Clipboard manager
cask "maccy"
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
cask "obs-virtualcam"
# File system integration
cask "osxfuse"
# Collaboration platform for API development
cask "postman"
# Web browser
cask "safari-technology-preview"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Team communication and collaboration software
cask "slack-beta"
cask "sonarr-beta"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
cask "station"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open source graphic user interface for OpenVPN
cask "tunnelblick-beta"
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
