tap "agrinman/tap"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "confluentinc/ccloud"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "iann0036/iamlive"
tap "kryptco/tap"
tap "nextdns/tap"
tap "pirj/noclamshell"
tap "transcend-io/tap"
tap "versent/taps"
tap "wagoodman/dive"
tap "wata727/tflint"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Record and share terminal sessions
brew "asciinema"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Implementation of the DNS protocols
brew "bind"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# GNU grep, egrep and fgrep
brew "grep"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Terminal-based visual file manager
brew "midnight-commander"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# DNS benchmark utility
brew "namebench"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Open Fortinet client for PPP+SSL VPN tunnel services
brew "openfortivpn"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Rsync for cloud storage
brew "rclone"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vpnc-script replacement for easy and secure split-tunnel VPN setup
brew "vpn-slice"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Linter for YAML files
brew "yamllint"
# View colored diff with side by side and auto pager support
brew "ydiff"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Nomad
brew "hashicorp/tap/nomad"
# Vault
brew "hashicorp/tap/vault"
# Generate an IAM policy from AWS calls using client-side monitoring (CSM) or embedded proxy.
brew "iann0036/iamlive/iamlive"
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns"
# Sleep despite annoying clamshell mode
brew "pirj/noclamshell/noclamshell"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
# Android SDK component
cask "android-platform-tools"
# Two-factor authentication software
cask "authy"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
cask "caldigit-docking-utility"
# Disk space visualizer
cask "daisydisk"
# Visually compare and merge files
cask "diffmerge"
# Voice and text chat software
cask "discord-ptb"
# App to build and share containerized applications and microservices
cask "docker-edge"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "google-chrome-canary"
# Web browser
cask "google-chrome-dev"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Provides access to camera controls
cask "logitech-camera-settings"
# Clipboard manager
cask "maccy"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Web browser
cask "safari-technology-preview"
# Store SSH keys in the Secure Enclave
cask "secretive"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Team communication and collaboration software
cask "slack-beta"
# Control your Sonos system
cask "sonos"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Workspace to manage all your productivity apps from one place
cask "stack-stack"
# Messaging app with a focus on speed and security
cask "telegram"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Free and open source graphic user interface for OpenVPN
cask "tunnelblick-beta"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
